# vanakam

import random

def பயனர்_உள்ளீடு():
    பயனர்_உள்ளீடு = input("ராக், பேப்பர், கத்தரிக்கோல் என்ற விருப்பத்தை உள்ளிடவும்   :").lower()
    while பயனர்_உள்ளீடு not in ["rock","paper","sicsser"]:
        print("hay செல்லுபடியாகும் விருப்பத்தை உள்ளிடவும்")
        பயனர்_உள்ளீடு = input("ராக், பேப்பர், கத்தரிக்கோல் என்ற விருப்பத்தை உள்ளிடவும்   :").lower()
    return பயனர்_உள்ளீடு



def கணினி_உள்ளீடு():

    கணினி_உள்ளீடு = random.choice(["rock","paper","scisser"])
    return கணினி_உள்ளீடு


def இறுதி_முடிவு(பயனர்_தேர்வு,கணினி_தேர்வு):

    print("உங்கள் விருப்பம்",பயனர்_தேர்வு)
    print("கணினி  விருப்பம்", கணினி_தேர்வு)

    if பயனர்_தேர்வு == கணினி_தேர்வு:
        return "போட்டி சமநிலை"
    
    elif ((பயனர்_தேர்வு=="rock" and கணினி_தேர்வு == "scisser")
          or(பயனர்_தேர்வு == "scisser" and கணினி_தேர்வு == "paper") or
          (பயனர்_தேர்வு == "paper" and கணினி_தேர்வு == "rock" )):
        
        return "நீ வெற்றி பெற்றாய்"
    else:
        return "கணினி வெற்றி"
    


def விளையாட்டு_விளையாடு():
    print("ராக் பேப்பர் கத்தரிக்கோல் விளையாட்டுக்கு வரவேற்கிறோம்")
    while True:
        பயனர்_தேர்வு = பயனர்_உள்ளீடு()
        கணினி_தேர்வு  = கணினி_உள்ளீடு() 
        முடிவு = இறுதி_முடிவு(பயனர்_தேர்வு,கணினி_தேர்வு)
        print(முடிவு)

        மறு_விளையாட்டு = input("மீண்டும் விளையாட விரும்புகிறீர்களா:(yes/no)").lower()

        if மறு_விளையாட்டு != "yes":
            print("விடைபெறுகிறேன் மீண்டும் பார்க்கலாம்")
            break

if __name__ == "__main__":
    விளையாட்டு_விளையாடு()





